In [8]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kaustubh hande\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\kaustubh hande\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [9]:
import pandas as pd 
import numpy as np

In [10]:
from pandas import DataFrame

In [11]:
data_pop={"City":["pune","nashik","mumbai","kolhapur","nagpur"],"Year":[2023,2023,2023,2023,2023],"Pop":[1.5,1.7,3.6,2.4,2.9]}

In [12]:
df = pd.DataFrame(data_pop)
df

       City  Year  Pop
0      pune  2023  1.5
1    nashik  2023  1.7
2    mumbai  2023  3.6
3  kolhapur  2023  2.4
4    nagpur  2023  2.9

In [13]:
#calling index
df.City[0] ,df.Pop[0]

('pune', 1.5)

In [14]:
#another method for calling index
df.index[df['City']=='pune']

Index([0], dtype='int64')

In [15]:
#another method for calling multiple index
columns_required=['City','Pop','Year']
df.loc[df['City'] =='pune',columns_required]

   City  Pop  Year
0  pune  1.5  2023

In [16]:
#simple method for calling multiple index
df.loc[[2],['City','Pop','Year']] # 2 indicate index value

     City  Pop  Year
2  mumbai  3.6  2023

In [17]:
#if we want data in column form
df.loc[2,['City','Pop','Year']]

City    mumbai
Pop        3.6
Year      2023
Name: 2, dtype: object

### another way to creat data frame using random.randint

In [18]:
import pandas as pd
import numpy as np

In [19]:
#random.randint :used to get the random number 
data=np.random.randint(0,30 ,size=(10,3))
data

array([[ 8, 25, 14],
       [27, 29, 21],
       [ 9, 13, 21],
       [ 1, 11, 13],
       [20, 23, 24],
       [26,  5, 20],
       [ 1, 23, 27],
       [ 7,  1,  0],
       [ 8, 28, 26],
       [ 7, 11, 25]])

In [20]:
df1=pd.DataFrame(data,columns=['col1','col2','col3'])
df1

   col1  col2  col3
0     8    25    14
1    27    29    21
2     9    13    21
3     1    11    13
4    20    23    24
5    26     5    20
6     1    23    27
7     7     1     0
8     8    28    26
9     7    11    25

### random.seed : It fixed random value

In [21]:
np.random.seed(30) #30 is just a name we can use any number

In [22]:

data=np.random.randint(0,30 ,size=(10,3))
data

array([[ 5,  5, 13],
       [13, 20, 12],
       [23,  2, 21],
       [27, 17, 14],
       [ 3,  9,  7],
       [23,  1, 17],
       [13, 29,  3],
       [18, 18, 20],
       [20,  6, 12],
       [16,  6, 27]])

In [23]:
df1=pd.DataFrame(data,columns=['col1','col2','col3'])
df1

   col1  col2  col3
0     5     5    13
1    13    20    12
2    23     2    21
3    27    17    14
4     3     9     7
5    23     1    17
6    13    29     3
7    18    18    20
8    20     6    12
9    16     6    27

In [34]:
#if we have to switch the columns we use & and if we add the column it will give null value
df=pd.DataFrame(df,columns=['Year','Pop','City'])
df

   Year  Pop      City
a  2023  1.5      pune
b  2023  1.7    nashik
c  2023  3.6    mumbai
d  2023  2.4  kolhapur
e  2023  2.9    nagpur

### Changing index using arrgument

In [35]:
df1 =pd.DataFrame(data_pop,columns=['Year','Pop','City'],index = ['1','2','3','4','5'])
df1

   Year  Pop      City
1  2023  1.5      pune
2  2023  1.7    nashik
3  2023  3.6    mumbai
4  2023  2.4  kolhapur
5  2023  2.9    nagpur

In [36]:
df.index=['a','b','c','d','e']
df

   Year  Pop      City
a  2023  1.5      pune
b  2023  1.7    nashik
c  2023  3.6    mumbai
d  2023  2.4  kolhapur
e  2023  2.9    nagpur

In [55]:
income_per_capita= pd.Series([2000,1000,5000,3000,2000],index=[1,2,3,4,5])
df1['income_per_capita']= income_per_capita
df1

   Year  Pop      City  income_per_capita
1  2023  1.5      pune                NaN
2  2023  1.7    nashik                NaN
3  2023  3.6    mumbai                NaN
4  2023  2.4  kolhapur                NaN
5  2023  2.9    nagpur                NaN

In [38]:
df['s.no'] = np.arange(1,6)
df

   Year  Pop      City  income_per_capita  s.no
a  2023  1.5      pune                NaN     1
b  2023  1.7    nashik                NaN     2
c  2023  3.6    mumbai                NaN     3
d  2023  2.4  kolhapur                NaN     4
e  2023  2.9    nagpur                NaN     5

In [39]:
df = pd.DataFrame(df,columns = ['s.no','Year','City','Pop','income_per_capita'])
df

   s.no  Year      City  Pop  income_per_capita
a     1  2023      pune  1.5                NaN
b     2  2023    nashik  1.7                NaN
c     3  2023    mumbai  3.6                NaN
d     4  2023  kolhapur  2.4                NaN
e     5  2023    nagpur  2.9                NaN

In [40]:
'''
Question 1: Creating a DataFrame

Create a DataFrame named students with the following data:
Name	Age	Grade
Alice	24	B
Bob	22	A
Charlie	23	B
David	25	C
Eva	22	A
Write the code to create this DataFrame.
'''

'\nQuestion 1: Creating a DataFrame\n\nCreate a DataFrame named students with the following data:\nName\tAge\tGrade\nAlice\t24\tB\nBob\t22\tA\nCharlie\t23\tB\nDavid\t25\tC\nEva\t22\tA\nWrite the code to create this DataFrame.\n'

In [67]:
import pandas as pd
import numpy as np

In [68]:
from pandas import DataFrame

In [69]:
student={'name':['Alice','bob','Charlie','David','Eva'],'Age':['24','22','23','25','22'],'Grade':['B','A','B','C','A']}
df=pd.DataFrame(student)
df

      name Age Grade
0    Alice  24     B
1      bob  22     A
2  Charlie  23     B
3    David  25     C
4      Eva  22     A

In [70]:
'''
Question 2: Adding a New Column

Add a new column named Passed to the students DataFrame. 
If the grade is 'A' or 'B', the value should be True; otherwise, it should be False.
'''

"\nQuestion 2: Adding a New Column\n\nAdd a new column named Passed to the students DataFrame. \nIf the grade is 'A' or 'B', the value should be True; otherwise, it should be False.\n"

In [71]:
stud= pd.DataFrame(student)

stud['passed']=stud['Grade'].apply(lambda garde : True if garde in ['A','B']else False)
stud

      name Age Grade  passed
0    Alice  24     B    True
1      bob  22     A    True
2  Charlie  23     B    True
3    David  25     C   False
4      Eva  22     A    True

In [72]:
''''
Question 3: Updating Column Values Using a Series

Create a pandas Series named new_ages with the following data:
24, 23, 22, 26, 21
Update the Age column of the students DataFrame with the values from the new_ages Series.
'''

"'\nQuestion 3: Updating Column Values Using a Series\n\nCreate a pandas Series named new_ages with the following data:\n24, 23, 22, 26, 21\nUpdate the Age column of the students DataFrame with the values from the new_ages Series.\n"

In [73]:
new_ages=pd.Series([24, 23, 22, 26, 21], index=[0,1,2,3,4])
stud['Age']= new_ages
stud

      name  Age Grade  passed
0    Alice   24     B    True
1      bob   23     A    True
2  Charlie   22     B    True
3    David   26     C   False
4      Eva   21     A    True

In [74]:
'''
Question 4: Updating Values Conditionally

Update the Grade column in the students DataFrame 
such that all students with an age greater 
than 23 have their grade changed to 'A+'.
'''

"\nQuestion 4: Updating Values Conditionally\n\nUpdate the Grade column in the students DataFrame \nsuch that all students with an age greater \nthan 23 have their grade changed to 'A+'.\n"

In [75]:
stud.loc[stud['Age']>23,'Grade']='A+'
stud

      name  Age Grade  passed
0    Alice   24    A+    True
1      bob   23     A    True
2  Charlie   22     B    True
3    David   26    A+   False
4      Eva   21     A    True

In [80]:
#another option for updating the change
def update_grade(d):
    if d ['Age']>23:
        d['Grade']='A+'
    return d
stud.apply(update_grade, axis=1)
stud

      name  Age Grade  passed
0    Alice   24    A+    True
1      bob   23     A    True
2  Charlie   22     B    True
3    David   26    A+   False
4      Eva   21     A    True

In [77]:
# another option for updating the change using lambda
stud['Grade']=stud.apply(lambda stud:'A+' if stud['Age']> 23 else stud['Grade'],axis=1)
stud

      name  Age Grade  passed
0    Alice   24    A+    True
1      bob   23     A    True
2  Charlie   22     B    True
3    David   26    A+   False
4      Eva   21     A    True

In [81]:
'''
Question 5: Renaming Columns


Rename the columns of the students DataFrame from Name, Age, Grade'''

'\nQuestion 5: Renaming Columns\n\n\nRename the columns of the students DataFrame from Name, Age, Grade'

In [90]:
#rename the columns
stud.rename(columns={'Name':'student name','Age':'student age','Grade':'student grade','passed':'passed exam'}, inplace= True)
stud.rename(columns=str.upper, inplace = True)
stud

      NAME  STUDENT AGE STUDENT GRADE  PASSED EXAM
0    Alice           24            A+         True
1      bob           23             A         True
2  Charlie           22             B         True
3    David           26            A+        False
4      Eva           21             A         True

In [94]:
#another option for rename the columns
stud.columns=['student name','student age','student grade', 'passed exam']
stud

  student name  student age student grade  passed exam
0        Alice           24            A+         True
1          bob           23             A         True
2      Charlie           22             B         True
3        David           26            A+        False
4          Eva           21             A         True

In [95]:
#Transpose is used for converting rows into columns & columns into rows
stud.T

                   0     1        2      3     4
student name   Alice   bob  Charlie  David   Eva
student age       24    23       22     26    21
student grade     A+     A        B     A+     A
passed exam     True  True     True  False  True

### drop nan: it drop the columns and rows which have null value

In [113]:
stud['Gender']=np.nan
stud.dropna(axis=1,how='all')
stud

  student name  student age student grade  passed exam  Gender
0        Alice           24            A+         True     NaN
1          bob           23             A         True     NaN
2      Charlie           22             B         True     NaN
3        David           26            A+        False     NaN
4          Eva           21             A         True     NaN

In [112]:
stud.dropna(axis=1,how='any')

  student name  student age student grade  passed exam
0        Alice           24            A+         True
1          bob           23             A         True
2      Charlie           22             B         True
3        David           26            A+        False
4          Eva           21             A         True

In [105]:
'''
#homwork
1.practice np.where and np.assign functions
2.read/practice all the function realted to pandas data frame 
3.complete one question on dataframe added below '''

'\n#homwork\n1.practice np.where and np.assign functions\n2.read/practice all the function realted to pandas data frame \n3.complete one question on dataframe added below '